v2206/atmospheric_Microclimate/benchmark_atmSims/atmForestStability/setups.orig/common/system/turbulenceFields
// -*- C++ -*-

type            turbulenceFields;
libs            (fieldFunctionObjects);
field           R;
writeControl    writeTime;


// *********************************************************************** //
